package HW4;
/*
 * Litvinenko homework 4
 */
//Задать массив с n чисел (используя инициализатор массива). Найти самое короткое и самое длинное число.
// Вывести найденные числа и их длину.

public class Task2 {
    public static void main(String[] args) {
//       int[] num1 =  {2, 3, 4, 6, 10, 13, 15, 3, 4, 5};
//        int min = 10, max = 0;
//        String minStr = null, maxStr = null;
//        for (int i : num1) {
//            System.out.println(num1);
//            if (num1.length() < min) {
//                min = num1.length();
//                minStr = num1;
//            }
//            if (num1.length() > max) {
//                max = num1.length();
//                maxStr = num1;
//            }
////        }
////        System.out.println("Минимальное число " + minStr + " состоит из " + min
////                + " цифр\nМаксимальное число " + maxStr + " состоит из " + max
////                + " цифр");
//    }
}
}

